In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {
    "A":[1, 2, np.nan],
    "B":[5, np.nan, np.nan],
    "C":[1, 2, 3]
}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# row

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
# axisは、0:row, 1:col
df.dropna()

     A    B  C
0  1.0  5.0  1

# column

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
# axisは、0:row, 1:col
df.dropna(axis=1)

   C
0  1
1  2
2  3

# fillina

In [12]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.fillna("FILLED")

        A       B  C
0     1.0     5.0  1
1     2.0  FILLED  2
2  FILLED  FILLED  3

In [14]:
df["A"].fillna(0)

0    1.0
1    2.0
2    0.0
Name: A, dtype: float64